zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_XS_PMA_MMD.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_XS_PMA_MMD
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_XS_PMA_MMD_H_)  /* Check if memory map has not been already included */
#define S32K566_XS_PMA_MMD_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- XS_PMA_MMD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XS_PMA_MMD_Peripheral_Access_Layer XS_PMA_MMD Peripheral Access Layer
 * @{
 */

/** XS_PMA_MMD - Register Layout Typedef */
typedef struct XS_PMA_MMD_Struct {
  __I  uint16_t VR_XS_PMA_RX_LSTS;                 /**< VR_XS_PMA_RX_LSTS, offset: 0x0 */
  uint8_t RESERVED_0[30];
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx General 0 Register, offset: 0x20 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx General 1 Register, offset: 0x22 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_TX_GENCTRL2;  /**< VR XS or PMA Synopsys Multi-protocol 12G/16G PHY Tx General 2 Register, offset: 0x24 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Tx Boost Control Register, offset: 0x26 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Tx Rate Control Register, offset: 0x28 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx Power State Register, offset: 0x2A */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx Equalization Control 0 Register, offset: 0x2C */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx Equalization Control 1 Register, offset: 0x2E */
  uint8_t RESERVED_1[8];
  __IO uint16_t VR_XS_PMA_MP_10G_TX_TERM_CTRL;     /**< VR XS or PMA Synopsys Multi-protocol 10G PHY Transmit Termination Control Register, offset: 0x38 */
  uint8_t RESERVED_2[6];
  __I  uint16_t VR_XS_PMA_MP_12G_16G_25G_TX_STS;   /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx Status Register, offset: 0x40 */
  uint8_t RESERVED_3[30];
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Rx General Control 0 Register, offset: 0x60 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Rx General Control 1 Register, offset: 0x62 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_RX_GENCTRL2;  /**< VR XS or PMA Synopsys Multi-protocol 12G/16G PHY Rx General Control 2 Register, offset: 0x64 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_RX_GENCTRL3;  /**< VR XS or PMA Synopsys Multi-protocol 12G/16G PHY Rx General Control 3 Register, offset: 0x66 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Rx Rate Control Register, offset: 0x68 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Rx Power State Register, offset: 0x6A */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Rx CDR Control Register, offset: 0x6C */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Rx Attenuation Control Register, offset: 0x6E */
  __IO uint16_t VR_XS_PMA_MP_12G_RX_EQ_CTRL0;      /**< VR XS or PMA Synopsys Multi-protocol 12G PHY Rx Equalization Control 0 Register, offset: 0x70 */
  uint8_t RESERVED_4[6];
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Rx Equalization Control 4 Register, offset: 0x78 */
  __IO uint16_t VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL;  /**< VR XS or PMA Synopsys Multi-protocol 12G PHY AFE-DFE Enable Register, offset: 0x7A */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY DFE Tap Control 0 Register, offset: 0x7C */
  uint8_t RESERVED_5[2];
  __I  uint16_t VR_XS_PMA_MP_12G_16G_25G_RX_STS;   /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Rx Status Register, offset: 0x80 */
  uint8_t RESERVED_6[6];
  __IO uint16_t VR_XS_PMA_MP_RX_TERM_CTRL;         /**< VR XS or PMA Synopsys Consumer 10G PHY Receive Termination Control Register, offset: 0x88 */
  uint8_t RESERVED_7[12];
  __IO uint16_t VR_XS_PMA_MP_10G_RX_IQ_CTRL0;      /**< VR XS or PMA Synopsys Multi-protocol 10G PHY RX IQ Control 0 Register, offset: 0x96 */
  uint8_t RESERVED_8[8];
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY MPLL Common Control Register, offset: 0xA0 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0;  /**< VR XS or PMA Synopsys Multi-protocol 12G/16G PHY MPLLA Control 0 Register, offset: 0xA2 */
  __IO uint16_t VR_XS_PMA_MP_12G_MPLLA_CTRL1;      /**< VR XS or PMA Synopsys Multi-protocol 12G PHY MPLLA Control 1 Register, offset: 0xA4 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2;  /**< VR XS or PMA Synopsys Multi-protocol 12G/16G PHY MPLLA Control 2 Register, offset: 0xA6 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0;  /**< VR XS or PMA Synopsys Multi-protocol 12G/16G PHY MPLLB Control 0 Register, offset: 0xA8 */
  __IO uint16_t VR_XS_PMA_MP_12G_MPLLB_CTRL1;      /**< VR XS or PMA Synopsys Multi-protocol 12G PHY MPLLB Control 1 Register, offset: 0xAA */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2;  /**< VR XS or PMA Synopsys Multi-protocol 12G/16G PHY MPLLB Control 2 Register, offset: 0xAC */
  __IO uint16_t VR_XS_PMA_MP_12G_MPLLA_CTRL3;      /**< VR XS or PMA Synopsys Multi-protocol 12G PHY MPLLA Control 3 Register, offset: 0xAE */
  __IO uint16_t VR_XS_PMA_MP_12G_MPLLB_CTRL3;      /**< VR XS or PMA Synopsys Multi-protocol 12G PHY MPLLB Control 3 Register, offset: 0xB0 */
  uint8_t RESERVED_9[46];
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Miscellaneous Control 0 Register, offset: 0xE0 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Reference Control Register, offset: 0xE2 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_VCO_CAL_LD0; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY VCO Calibration Load 0 Register, offset: 0xE4 */
  uint8_t RESERVED_10[6];
  __IO uint16_t VR_XS_PMA_MP_12G_VCO_CAL_REF0;     /**< VR XS or PMA Synopsys Multi-protocol 12G PHY VCO Calibration Reference 0 Register, offset: 0xEC */
  uint8_t RESERVED_11[2];
  __I  uint16_t VR_XS_PMA_MP_12G_16G_25G_MISC_STS; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Miscellaneous Status Register, offset: 0xF0 */
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL1; /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Miscellaneous Control 1 Register, offset: 0xF2 */
  uint8_t RESERVED_12[2];
  __IO uint16_t VR_XS_PMA_MP_12G_16G_25G_SRAM;     /**< VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY SRAM Register., offset: 0xF6 */
  uint8_t RESERVED_13[8];
  __IO uint16_t VR_XS_PMA_SNPS_CR_CTRL;            /**< VR XS or PMA Synopsys PHY CR Control Register, offset: 0x100 */
  __IO uint16_t VR_XS_PMA_SNPS_CR_ADDR;            /**< VR XS or PMA Synopsys PHY CR Address Register, offset: 0x102 */
  __IO uint16_t VR_XS_PMA_SNPS_CR_DATA;            /**< VR XS or PMA Synopsys CR Data Register, offset: 0x104 */
} XS_PMA_MMD_Type, *XS_PMA_MMD_MemMapPtr;

