zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
/** Number of instances of the XS_PMA_MMD module. */
#define XS_PMA_MMD_INSTANCE_COUNT                (1u)

/* XS_PMA_MMD - Peripheral instance base addresses */
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PMA_MMD base address */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PMA_MMD_BASE (0x830040u)
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PMA_MMD base pointer */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PMA_MMD ((XS_PMA_MMD_Type *)IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PMA_MMD_BASE)
/** Array initializer of XS_PMA_MMD peripheral base addresses */
#define IP_XS_PMA_MMD_BASE_ADDRS                 { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PMA_MMD_BASE }
/** Array initializer of XS_PMA_MMD peripheral base pointers */
#define IP_XS_PMA_MMD_BASE_PTRS                  { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__XPCS__XS_PMA_MMD }

/* ----------------------------------------------------------------------------
   -- XS_PMA_MMD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XS_PMA_MMD_Register_Masks XS_PMA_MMD Register Masks
 * @{
 */

/*! @name VR_XS_PMA_RX_LSTS - VR_XS_PMA_RX_LSTS */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_SIG_DET_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_SIG_DET_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_SIG_DET_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_SIG_DET_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_RX_LSTS_SIG_DET_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_RX_LSTS_SIG_DET_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_0_MASK (0x1000U)
#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_0_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_3_1_MASK (0xE000U)
#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_3_1_SHIFT (13U)
#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_RX_LSTS_RX_VALID_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx General 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TXBCN_EN_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TXBCN_EN_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TXBCN_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TXBCN_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TXBCN_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TXBCN_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_INV_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_INV_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_INV_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_INV_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_INV_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_INV_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_0_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_0_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_3_1_MASK (0xE00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_3_1_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_RST_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_0_MASK (0x1000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_0_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_3_1_MASK (0xE000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_3_1_SHIFT (13U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL0_TX_DT_EN_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx General 1 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_DET_RX_REQ_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_EN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_LVL_MASK (0x700U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_LVL_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_LVL_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_LVL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_LVL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_VBOOST_LVL_MASK)

