zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_0_MASK (0x1000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_0_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_3_1_MASK (0xE000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_3_1_SHIFT (13U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_GENCTRL1_TX_CLK_RDY_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_TX_GENCTRL2 - VR XS or PMA Synopsys Multi-protocol 12G/16G PHY Tx General 2 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_REQ_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX_LPD_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX0_WIDTH_MASK (0x300U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX0_WIDTH_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX0_WIDTH_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX0_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX0_WIDTH_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX0_WIDTH_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX1_WIDTH_MASK (0xC00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX1_WIDTH_SHIFT (10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX1_WIDTH_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX1_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX1_WIDTH_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX1_WIDTH_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX2_WIDTH_MASK (0x3000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX2_WIDTH_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX2_WIDTH_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX2_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX2_WIDTH_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX2_WIDTH_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX3_WIDTH_MASK (0xC000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX3_WIDTH_SHIFT (14U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX3_WIDTH_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX3_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX3_WIDTH_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_TX_GENCTRL2_TX3_WIDTH_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Tx Boost Control Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX0_IBOOST_MASK (0xFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX0_IBOOST_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX0_IBOOST_WIDTH (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX0_IBOOST(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX0_IBOOST_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX0_IBOOST_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX1_IBOOST_MASK (0xF0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX1_IBOOST_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX1_IBOOST_WIDTH (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX1_IBOOST(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX1_IBOOST_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX1_IBOOST_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX2_IBOOST_MASK (0xF00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX2_IBOOST_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX2_IBOOST_WIDTH (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX2_IBOOST(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX2_IBOOST_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX2_IBOOST_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX3_IBOOST_MASK (0xF000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX3_IBOOST_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX3_IBOOST_WIDTH (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX3_IBOOST(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX3_IBOOST_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_BOOST_CTRL_TX3_IBOOST_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Tx Rate Control Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX0_RATE_MASK (0x7U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX0_RATE_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX0_RATE_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX0_RATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX0_RATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX0_RATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX1_RATE_MASK (0x70U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX1_RATE_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX1_RATE_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX1_RATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX1_RATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX1_RATE_MASK)

