zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX2_RATE_MASK (0x700U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX2_RATE_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX2_RATE_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX2_RATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX2_RATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX2_RATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX3_RATE_MASK (0x7000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX3_RATE_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX3_RATE_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX3_RATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX3_RATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_RATE_CTRL_TX3_RATE_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx Power State Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX0_PSTATE_MASK (0x3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX0_PSTATE_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX0_PSTATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX0_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX0_PSTATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX0_PSTATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX1_PSTATE_MASK (0xCU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX1_PSTATE_SHIFT (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX1_PSTATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX1_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX1_PSTATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX1_PSTATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX2_PSTATE_MASK (0x30U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX2_PSTATE_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX2_PSTATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX2_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX2_PSTATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX2_PSTATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX3_PSTATE_MASK (0xC0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX3_PSTATE_SHIFT (6U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX3_PSTATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX3_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX3_PSTATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX3_PSTATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_0_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_0_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_3_1_MASK (0xE00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_3_1_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_POWER_STATE_CTRL_TX_DISABLE_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx Equalization Control 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_PRE_MASK (0x3FU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_PRE_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_PRE_WIDTH (6U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_PRE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_PRE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_PRE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_MAIN_MASK (0x3F00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_MAIN_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_MAIN_WIDTH (6U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_MAIN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_MAIN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL0_TX_EQ_MAIN_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx Equalization Control 1 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_POST_MASK (0x3FU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_POST_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_POST_WIDTH (6U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_POST(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_POST_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_POST_MASK)

