zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_OVR_RIDE_MASK (0x40U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_OVR_RIDE_SHIFT (6U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_OVR_RIDE_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_OVR_RIDE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_OVR_RIDE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_OVR_RIDE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_DEF_CTRL_MASK (0x80U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_DEF_CTRL_SHIFT (7U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_DEF_CTRL_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_DEF_CTRL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_DEF_CTRL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_TX_EQ_DEF_CTRL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_CA_TX_EQ_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_CA_TX_EQ_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_CA_TX_EQ_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_CA_TX_EQ(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_CA_TX_EQ_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_EQ_CTRL1_CA_TX_EQ_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_10G_TX_TERM_CTRL - VR XS or PMA Synopsys Multi-protocol 10G PHY Transmit Termination Control Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX0_TERM_MASK (0x7U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX0_TERM_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX0_TERM_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX0_TERM(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX0_TERM_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX0_TERM_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX1_TERM_MASK (0x70U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX1_TERM_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX1_TERM_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX1_TERM(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX1_TERM_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX1_TERM_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX2_TERM_MASK (0x700U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX2_TERM_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX2_TERM_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX2_TERM(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX2_TERM_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX2_TERM_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX3_TERM_MASK (0x7000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX3_TERM_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX3_TERM_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX3_TERM(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX3_TERM_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_10G_TX_TERM_CTRL_TX3_TERM_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_TX_STS - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Tx Status Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_TX_ACK_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_TX_STS_DETRX_RSLT_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Rx General Control 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_TERM_EN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_ALIGN_EN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_0_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_0_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_3_1_MASK (0xE00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_3_1_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_DT_EN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_0_MASK (0x1000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_0_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_0_MASK)

