zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_3_1_MASK (0xE000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_3_1_SHIFT (13U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL0_RX_CLKSFT_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Rx General Control 1 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_INV_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_RST_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_0_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_0_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_3_1_MASK (0xE00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_3_1_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_GENCTRL1_RX_TERM_ACDC_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_RX_GENCTRL2 - VR XS or PMA Synopsys Multi-protocol 12G/16G PHY Rx General Control 2 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_REQ_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX_LPD_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX0_WIDTH_MASK (0x300U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX0_WIDTH_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX0_WIDTH_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX0_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX0_WIDTH_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX0_WIDTH_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX1_WIDTH_MASK (0xC00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX1_WIDTH_SHIFT (10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX1_WIDTH_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX1_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX1_WIDTH_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX1_WIDTH_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX2_WIDTH_MASK (0x3000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX2_WIDTH_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX2_WIDTH_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX2_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX2_WIDTH_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX2_WIDTH_MASK)

