zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX3_WIDTH_MASK (0xC000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX3_WIDTH_SHIFT (14U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX3_WIDTH_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX3_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX3_WIDTH_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL2_RX3_WIDTH_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_RX_GENCTRL3 - VR XS or PMA Synopsys Multi-protocol 12G/16G PHY Rx General Control 3 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_0_MASK (0x7U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_0_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_1_MASK (0x38U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_1_SHIFT (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_2_MASK (0x1C0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_2_SHIFT (6U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_2_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_2(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_2_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_2_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_3_MASK (0xE00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_3_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_3_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_3(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_3_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_TRSHLD_3_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_0_MASK (0x1000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_0_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_3_1_MASK (0xE000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_3_1_SHIFT (13U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_RX_GENCTRL3_LOS_LFPS_EN_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Rx Rate Control Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX0_RATE_MASK (0x3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX0_RATE_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX0_RATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX0_RATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX0_RATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX0_RATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX1_RATE_MASK (0x30U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX1_RATE_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX1_RATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX1_RATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX1_RATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX1_RATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX2_RATE_MASK (0x300U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX2_RATE_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX2_RATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX2_RATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX2_RATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX2_RATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX3_RATE_MASK (0x3000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX3_RATE_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX3_RATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX3_RATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX3_RATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_RATE_CTRL_RX3_RATE_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Rx Power State Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX0_PSTATE_MASK (0x3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX0_PSTATE_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX0_PSTATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX0_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX0_PSTATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX0_PSTATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX1_PSTATE_MASK (0xCU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX1_PSTATE_SHIFT (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX1_PSTATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX1_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX1_PSTATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX1_PSTATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX2_PSTATE_MASK (0x30U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX2_PSTATE_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX2_PSTATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX2_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX2_PSTATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX2_PSTATE_MASK)

