zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX3_PSTATE_MASK (0xC0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX3_PSTATE_SHIFT (6U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX3_PSTATE_WIDTH (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX3_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX3_PSTATE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX3_PSTATE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_0_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_0_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_3_1_MASK (0xE00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_3_1_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_RX_DISABLE_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_EEE_OVR_RIDE_MASK (0x1000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_EEE_OVR_RIDE_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_EEE_OVR_RIDE_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_EEE_OVR_RIDE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_EEE_OVR_RIDE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_POWER_STATE_CTRL_EEE_OVR_RIDE_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Rx CDR Control Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_TRACK_EN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_CDR_SSC_EN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_0_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_0_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_3_1_MASK (0xE00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_3_1_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_CDR_CTRL_VCO_LOW_FREQ_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Rx Attenuation Control Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX0_EQ_ATT_LVL_MASK (0x7U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX0_EQ_ATT_LVL_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX0_EQ_ATT_LVL_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX0_EQ_ATT_LVL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX0_EQ_ATT_LVL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX0_EQ_ATT_LVL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX1_EQ_ATT_LVL_MASK (0x70U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX1_EQ_ATT_LVL_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX1_EQ_ATT_LVL_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX1_EQ_ATT_LVL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX1_EQ_ATT_LVL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX1_EQ_ATT_LVL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX2_EQ_ATT_LVL_MASK (0x700U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX2_EQ_ATT_LVL_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX2_EQ_ATT_LVL_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX2_EQ_ATT_LVL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX2_EQ_ATT_LVL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX2_EQ_ATT_LVL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX3_EQ_ATT_LVL_MASK (0x7000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX3_EQ_ATT_LVL_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX3_EQ_ATT_LVL_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX3_EQ_ATT_LVL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX3_EQ_ATT_LVL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_ATTN_CTRL_RX3_EQ_ATT_LVL_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_RX_EQ_CTRL0 - VR XS or PMA Synopsys Multi-protocol 12G PHY Rx Equalization Control 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_CTLE_BOOST_0_MASK (0x1FU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_CTLE_BOOST_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_CTLE_BOOST_0_WIDTH (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_CTLE_BOOST_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_CTLE_BOOST_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_CTLE_BOOST_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_AFE_GAIN_0_MASK (0xF000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_AFE_GAIN_0_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_AFE_GAIN_0_WIDTH (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_AFE_GAIN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_AFE_GAIN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_RX_EQ_CTRL0_AFE_GAIN_0_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Rx Equalization Control 4 Register */
/*! @{ */

