zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_ADAPT_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_CONT_OFF_CAN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SEQ_EQ_EN_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SEQ_EQ_EN_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SEQ_EQ_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SEQ_EQ_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SEQ_EQ_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SEQ_EQ_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_PING_PONG_EN_MASK (0x200U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_PING_PONG_EN_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_PING_PONG_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_PING_PONG_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_PING_PONG_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_PING_PONG_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SELF_MAIN_EN_MASK (0x400U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SELF_MAIN_EN_SHIFT (10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SELF_MAIN_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SELF_MAIN_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SELF_MAIN_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_SELF_MAIN_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_EQ_STRT_CTRL_MASK (0x800U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_EQ_STRT_CTRL_SHIFT (11U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_EQ_STRT_CTRL_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_EQ_STRT_CTRL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_EQ_STRT_CTRL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_EQ_STRT_CTRL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_AD_REQ_MASK (0x1000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_AD_REQ_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_AD_REQ_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_AD_REQ(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_AD_REQ_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_EQ_CTRL4_RX_AD_REQ_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL - VR XS or PMA Synopsys Multi-protocol 12G PHY AFE-DFE Enable Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_AFE_EN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_AFE_DFE_EN_CTRL_DFE_EN_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY DFE Tap Control 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_0_MASK (0xFFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_0_WIDTH (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_0_MASK)

