zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_1_MASK (0xFF00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_1_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_1_WIDTH (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_DFE_TAP_CTRL0_DFE_TAP1_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_RX_STS - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Rx Status Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_RX_ACK_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_LF_SD_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_0_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_0_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_3_1_MASK (0xE00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_3_1_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_RX_STS_HF_SD_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_RX_TERM_CTRL - VR XS or PMA Synopsys Consumer 10G PHY Receive Termination Control Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX0_TERM_MASK (0x7U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX0_TERM_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX0_TERM_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX0_TERM(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX0_TERM_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX0_TERM_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX1_TERM_MASK (0x70U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX1_TERM_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX1_TERM_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX1_TERM(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX1_TERM_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX1_TERM_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX2_TERM_MASK (0x700U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX2_TERM_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX2_TERM_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX2_TERM(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX2_TERM_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX2_TERM_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX3_TERM_MASK (0x7000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX3_TERM_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX3_TERM_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX3_TERM(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX3_TERM_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_RX_TERM_CTRL_RX3_TERM_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_10G_RX_IQ_CTRL0 - VR XS or PMA Synopsys Multi-protocol 10G PHY RX IQ Control 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_10G_RX_IQ_CTRL0_RX0_DELTA_IQ_MASK (0xF00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_RX_IQ_CTRL0_RX0_DELTA_IQ_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_RX_IQ_CTRL0_RX0_DELTA_IQ_WIDTH (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_10G_RX_IQ_CTRL0_RX0_DELTA_IQ(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_10G_RX_IQ_CTRL0_RX0_DELTA_IQ_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_10G_RX_IQ_CTRL0_RX0_DELTA_IQ_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY MPLL Common Control Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_0_MASK)

