zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLL_EN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MPLL_CMN_CTRL_MPLLB_SEL_3_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0 - VR XS or PMA Synopsys Multi-protocol 12G/16G PHY MPLLA Control 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_MULTIPLIER_MASK (0xFFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_MULTIPLIER_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_MULTIPLIER_WIDTH (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_MULTIPLIER_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_MULTIPLIER_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_SSC_CLK_SEL_MASK (0x700U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_SSC_CLK_SEL_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_SSC_CLK_SEL_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_SSC_CLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_SSC_CLK_SEL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_SSC_CLK_SEL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FRAC_EN_MASK (0x1000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FRAC_EN_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FRAC_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FRAC_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FRAC_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FRAC_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FR_CFG_UP_EN_MASK (0x2000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FR_CFG_UP_EN_SHIFT (13U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FR_CFG_UP_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FR_CFG_UP_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FR_CFG_UP_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_FR_CFG_UP_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_PMIX_EN_MASK (0x4000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_PMIX_EN_SHIFT (14U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_PMIX_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_PMIX_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_PMIX_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_PMIX_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_CAL_DISABLE_MASK (0x8000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_CAL_DISABLE_SHIFT (15U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_CAL_DISABLE_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_CAL_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_CAL_DISABLE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL0_MPLLA_CAL_DISABLE_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_MPLLA_CTRL1 - VR XS or PMA Synopsys Multi-protocol 12G PHY MPLLA Control 1 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_EN_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_EN_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_RANGE_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_RANGE_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_RANGE_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_RANGE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_RANGE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_RANGE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_CLK_SEL_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_CLK_SEL_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_CLK_SEL_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_CLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_CLK_SEL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_SSC_CLK_SEL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_FRACN_CTRL_MASK (0xFFE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_FRACN_CTRL_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_FRACN_CTRL_WIDTH (11U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_FRACN_CTRL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_FRACN_CTRL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL1_MPLLA_FRACN_CTRL_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2 - VR XS or PMA Synopsys Multi-protocol 12G/16G PHY MPLLA Control 2 Register */
/*! @{ */

