zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_MULT_MASK (0xFFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_MULT_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_MULT_WIDTH (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_MULT(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_MULT_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_MULT_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV8_CLK_EN_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV8_CLK_EN_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV8_CLK_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV8_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV8_CLK_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV8_CLK_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV10_CLK_EN_MASK (0x200U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV10_CLK_EN_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV10_CLK_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV10_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV10_CLK_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV10_CLK_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_CLK_EN_MASK (0x400U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_CLK_EN_SHIFT (10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_CLK_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_CLK_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_DIV_CLK_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_TX_CLK_DIV_MASK (0x3800U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_TX_CLK_DIV_SHIFT (11U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_TX_CLK_DIV_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_TX_CLK_DIV(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_TX_CLK_DIV_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_TX_CLK_DIV_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_RECAL_BANK_SEL_MASK (0x4000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_RECAL_BANK_SEL_SHIFT (14U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_RECAL_BANK_SEL_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_RECAL_BANK_SEL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_RECAL_BANK_SEL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_RECAL_BANK_SEL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_WRD_DIV2_EN_MASK (0x8000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_WRD_DIV2_EN_SHIFT (15U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_WRD_DIV2_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_WRD_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_WRD_DIV2_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLA_CTRL2_MPLLA_WRD_DIV2_EN_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0 - VR XS or PMA Synopsys Multi-protocol 12G/16G PHY MPLLB Control 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_MULTIPLIER_MASK (0xFFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_MULTIPLIER_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_MULTIPLIER_WIDTH (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_MULTIPLIER_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_MULTIPLIER_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_SSC_CLK_SEL_MASK (0x700U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_SSC_CLK_SEL_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_SSC_CLK_SEL_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_SSC_CLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_SSC_CLK_SEL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_SSC_CLK_SEL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FRAC_EN_MASK (0x1000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FRAC_EN_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FRAC_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FRAC_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FRAC_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FRAC_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FR_CFG_UP_EN_MASK (0x2000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FR_CFG_UP_EN_SHIFT (13U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FR_CFG_UP_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FR_CFG_UP_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FR_CFG_UP_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_FR_CFG_UP_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_PMIX_EN_MASK (0x4000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_PMIX_EN_SHIFT (14U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_PMIX_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_PMIX_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_PMIX_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_PMIX_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_CAL_DISABLE_MASK (0x8000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_CAL_DISABLE_SHIFT (15U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_CAL_DISABLE_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_CAL_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_CAL_DISABLE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL0_MPLLB_CAL_DISABLE_MASK)
/*! @} */

