zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
/*! @name VR_XS_PMA_MP_12G_MPLLB_CTRL1 - VR XS or PMA Synopsys Multi-protocol 12G PHY MPLLB Control 1 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_EN_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_EN_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_RANGE_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_RANGE_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_RANGE_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_RANGE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_RANGE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_SSC_RANGE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_FRACN_CTRL_MASK (0xFFE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_FRACN_CTRL_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_FRACN_CTRL_WIDTH (11U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_FRACN_CTRL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_FRACN_CTRL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL1_MPLLB_FRACN_CTRL_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2 - VR XS or PMA Synopsys Multi-protocol 12G/16G PHY MPLLB Control 2 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_MULT_MASK (0xFFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_MULT_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_MULT_WIDTH (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_MULT(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_MULT_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_MULT_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV8_CLK_EN_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV8_CLK_EN_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV8_CLK_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV8_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV8_CLK_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV8_CLK_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV10_CLK_EN_MASK (0x200U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV10_CLK_EN_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV10_CLK_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV10_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV10_CLK_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV10_CLK_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_CLK_EN_MASK (0x400U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_CLK_EN_SHIFT (10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_CLK_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_CLK_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_DIV_CLK_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_TX_CLK_DIV_MASK (0x3800U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_TX_CLK_DIV_SHIFT (11U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_TX_CLK_DIV_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_TX_CLK_DIV(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_TX_CLK_DIV_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_TX_CLK_DIV_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_RECAL_BANK_SEL_MASK (0x4000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_RECAL_BANK_SEL_SHIFT (14U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_RECAL_BANK_SEL_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_RECAL_BANK_SEL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_RECAL_BANK_SEL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_MPLLB_CTRL2_MPLLB_RECAL_BANK_SEL_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_MPLLA_CTRL3 - VR XS or PMA Synopsys Multi-protocol 12G PHY MPLLA Control 3 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL3_MPLLA_BANDWIDTH_MASK (0xFFFFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL3_MPLLA_BANDWIDTH_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL3_MPLLA_BANDWIDTH_WIDTH (16U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL3_MPLLA_BANDWIDTH(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL3_MPLLA_BANDWIDTH_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLA_CTRL3_MPLLA_BANDWIDTH_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_MPLLB_CTRL3 - VR XS or PMA Synopsys Multi-protocol 12G PHY MPLLB Control 3 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL3_MPLLB_BANDWIDTH_MASK (0xFFFFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL3_MPLLB_BANDWIDTH_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL3_MPLLB_BANDWIDTH_WIDTH (16U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL3_MPLLB_BANDWIDTH(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL3_MPLLB_BANDWIDTH_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_MPLLB_CTRL3_MPLLB_BANDWIDTH_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Miscellaneous Control 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_0_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_0_MASK)

