zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_3_1_MASK (0xEU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_3_1_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_TX2RX_LB_EN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_0_MASK (0x10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_0_SHIFT (4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_0_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_3_1_MASK (0xE0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_3_1_SHIFT (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_3_1_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_3_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_3_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX2TX_LB_EN_3_1_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX_VREF_CTRL_MASK (0x1F00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX_VREF_CTRL_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX_VREF_CTRL_WIDTH (5U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX_VREF_CTRL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX_VREF_CTRL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RX_VREF_CTRL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RTUNE_REQ_MASK (0x2000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RTUNE_REQ_SHIFT (13U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RTUNE_REQ_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RTUNE_REQ(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RTUNE_REQ_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_RTUNE_REQ_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_CR_PARA_SEL_MASK (0x4000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_CR_PARA_SEL_SHIFT (14U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_CR_PARA_SEL_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_CR_PARA_SEL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_CR_PARA_SEL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_CR_PARA_SEL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_PLL_CTRL_MASK (0x8000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_PLL_CTRL_SHIFT (15U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_PLL_CTRL_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_PLL_CTRL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_PLL_CTRL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL0_PLL_CTRL_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY Reference Control Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_EN_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_EN_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_USE_PAD_MASK (0x2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_USE_PAD_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_USE_PAD_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_USE_PAD(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_USE_PAD_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_USE_PAD_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_DIV2_MASK (0x4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_DIV2_SHIFT (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_DIV2_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_DIV2(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_DIV2_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_CLK_DIV2_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RANGE_MASK (0x38U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RANGE_SHIFT (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RANGE_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RANGE(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RANGE_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RANGE_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV2_MASK (0x40U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV2_SHIFT (6U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV2_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV2(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV2_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV2_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV2_MASK (0x80U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV2_SHIFT (7U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV2_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV2(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV2_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV2_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RPT_CLK_EN_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RPT_CLK_EN_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RPT_CLK_EN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RPT_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RPT_CLK_EN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_RPT_CLK_EN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_ALT_LP_CLK_SEL_MASK (0x200U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_ALT_LP_CLK_SEL_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_ALT_LP_CLK_SEL_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_ALT_LP_CLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_ALT_LP_CLK_SEL_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_ALT_LP_CLK_SEL_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV_MASK (0x1C00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV_SHIFT (10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLA_DIV_MASK)

