zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV_MASK (0xE000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV_SHIFT (13U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV_WIDTH (3U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_REF_CLK_CTRL_REF_MPLLB_DIV_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_VCO_CAL_LD0 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G PHY VCO Calibration Load 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_VCO_CAL_LD0_VCO_LD_VAL_0_MASK (0x1FFFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_VCO_CAL_LD0_VCO_LD_VAL_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_VCO_CAL_LD0_VCO_LD_VAL_0_WIDTH (13U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_VCO_CAL_LD0_VCO_LD_VAL_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_VCO_CAL_LD0_VCO_LD_VAL_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_VCO_CAL_LD0_VCO_LD_VAL_0_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_VCO_CAL_REF0 - VR XS or PMA Synopsys Multi-protocol 12G PHY VCO Calibration Reference 0 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_0_MASK (0x3FU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_0_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_0_WIDTH (6U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_0(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_0_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_0_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_1_MASK (0x3F00U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_1_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_1_WIDTH (6U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_1(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_1_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_VCO_CAL_REF0_VCO_REF_LD_1_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_MISC_STS - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Miscellaneous Status Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_FOM_MASK (0xFFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_FOM_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_FOM_WIDTH (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_FOM(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_FOM_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_FOM_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RTUNE_ACK_MASK (0x100U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RTUNE_ACK_SHIFT (8U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RTUNE_ACK_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RTUNE_ACK(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RTUNE_ACK_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RTUNE_ACK_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLA_STS_MASK (0x200U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLA_STS_SHIFT (9U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLA_STS_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLA_STS(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLA_STS_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLA_STS_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLB_STS_MASK (0x400U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLB_STS_SHIFT (10U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLB_STS_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLB_STS(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLB_STS_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_MPLLB_STS_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_REF_CLKDET_RESULT_MASK (0x800U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_REF_CLKDET_RESULT_SHIFT (11U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_REF_CLKDET_RESULT_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_REF_CLKDET_RESULT(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_REF_CLKDET_RESULT_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_REF_CLKDET_RESULT_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RX_ADPT_ACK_MASK (0x1000U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RX_ADPT_ACK_SHIFT (12U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RX_ADPT_ACK_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RX_ADPT_ACK(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RX_ADPT_ACK_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_STS_RX_ADPT_ACK_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL1 - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY Miscellaneous Control 1 Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL1_RX_LNK_UP_TIME_MASK (0xFFFFU)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL1_RX_LNK_UP_TIME_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL1_RX_LNK_UP_TIME_WIDTH (16U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL1_RX_LNK_UP_TIME(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL1_RX_LNK_UP_TIME_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_MISC_CTRL1_RX_LNK_UP_TIME_MASK)
/*! @} */

/*! @name VR_XS_PMA_MP_12G_16G_25G_SRAM - VR XS or PMA Synopsys Multi-protocol 12G/16G/25G/32G PHY SRAM Register. */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_INIT_DN_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_INIT_DN_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_INIT_DN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_INIT_DN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_INIT_DN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_INIT_DN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_EXT_LD_DN_MASK (0x2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_EXT_LD_DN_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_EXT_LD_DN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_EXT_LD_DN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_EXT_LD_DN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_EXT_LD_DN_MASK)

#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_BTLD_BYP_MASK (0x4U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_BTLD_BYP_SHIFT (2U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_BTLD_BYP_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_BTLD_BYP(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_BTLD_BYP_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_MP_12G_16G_25G_SRAM_BTLD_BYP_MASK)
/*! @} */

