zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XS_PMA_MMD.h
/*! @name VR_XS_PMA_SNPS_CR_CTRL - VR XS or PMA Synopsys PHY CR Control Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_START_BUSY_MASK (0x1U)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_START_BUSY_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_START_BUSY_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_START_BUSY(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_START_BUSY_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_START_BUSY_MASK)

#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_WR_RDN_MASK (0x2U)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_WR_RDN_SHIFT (1U)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_WR_RDN_WIDTH (1U)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_WR_RDN(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_WR_RDN_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_SNPS_CR_CTRL_WR_RDN_MASK)
/*! @} */

/*! @name VR_XS_PMA_SNPS_CR_ADDR - VR XS or PMA Synopsys PHY CR Address Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_ADDR_ADDRESS_MASK (0xFFFFU)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_ADDR_ADDRESS_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_ADDR_ADDRESS_WIDTH (16U)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_ADDR_ADDRESS(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_SNPS_CR_ADDR_ADDRESS_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_SNPS_CR_ADDR_ADDRESS_MASK)
/*! @} */

/*! @name VR_XS_PMA_SNPS_CR_DATA - VR XS or PMA Synopsys CR Data Register */
/*! @{ */

#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_DATA_DATA_MASK (0xFFFFU)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_DATA_DATA_SHIFT (0U)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_DATA_DATA_WIDTH (16U)
#define XS_PMA_MMD_VR_XS_PMA_SNPS_CR_DATA_DATA(x) (((uint16_t)(((uint16_t)(x)) << XS_PMA_MMD_VR_XS_PMA_SNPS_CR_DATA_DATA_SHIFT)) & XS_PMA_MMD_VR_XS_PMA_SNPS_CR_DATA_DATA_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group XS_PMA_MMD_Register_Masks */

/*!
 * @}
 */ /* end of group XS_PMA_MMD_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_XS_PMA_MMD_H_) */
